-- 基础信息
local base_info = {
	group_id = 133307441
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 441001, gadget_id = 70210101, pos = { x = -1535.08, y = 25.586, z = 5160.382 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜破损须弥", persistent = true, area_id = 32 },
	{ config_id = 441002, gadget_id = 70210101, pos = { x = -1578.55, y = 15.496, z = 5186.227 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜破损须弥", persistent = true, area_id = 32 },
	{ config_id = 441003, gadget_id = 70210101, pos = { x = -1539.595, y = 26.098, z = 5146.383 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜果蔬须弥", persistent = true, area_id = 32 },
	{ config_id = 441004, gadget_id = 70330396, pos = { x = -1541.323, y = 25.697, z = 5149.675 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 441005, gadget_id = 70330396, pos = { x = -1539.1, y = 25.697, z = 5159.39 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 441006, gadget_id = 70330396, pos = { x = -1569.812, y = 18.523, z = 5170.588 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 441007, gadget_id = 70330396, pos = { x = -1552.257, y = 33.916, z = 5120.069 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 441008, gadget_id = 70310006, pos = { x = -1566.624, y = 18.368, z = 5172.243 }, rot = { x = 2.882, y = 6.329, z = 358.145 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 441003, 441007, 441005, 441004, 441001, 441008, 441006, 441002 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================