-- 基础信息
local base_info = {
    group_id = 133308864
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 864001, monster_id = 28010404, pos = { x = -1282.095, y = 77.225, z = 5072.776 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "采集动物", pose_id = 1, area_id = 32 },
	{ config_id = 864002, monster_id = 28010404, pos = { x = -1280.488, y = 76.202, z = 5073.989 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "采集动物", pose_id = 1, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 864003, gadget_id = 70330428, pos = { x = -1282.15, y = 77.029, z = 5072.785 }, rot = { x = 359.849, y = 180, z = 180 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 864005, gadget_id = 70220063, pos = { x = -1280.343, y = 77.233, z = 5071.764 }, rot = { x = 353.257, y = 350.271, z = 296.261 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 864006, gadget_id = 70330428, pos = { x = -1280.465, y = 76.221, z = 5074.425 }, rot = { x = 15.623, y = 0.897, z = 107.045 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 864007, gadget_id = 70210101, pos = { x = -1280.158, y = 77.187, z = 5072.019 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 864002, 864001 },
	gadgets = { 864003, 864006, 864007, 864005 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
