-- 基础信息
local base_info = {
    group_id = 133314597
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 597004, monster_id = 21010301, pos = { x = -101.831, y = 16.754, z = 5076.808 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "丘丘人", pose_id = 9010, area_id = 32 },
	{ config_id = 597005, monster_id = 21010201, pos = { x = -104.023, y = 16.647, z = 5075.033 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "丘丘人", pose_id = 9010, area_id = 32 },
	{ config_id = 597006, monster_id = 25210303, pos = { x = -102.358, y = 18.937, z = 5067.671 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 597001, gadget_id = 70300094, pos = { x = -101.582, y = 17.79, z = 5072.088 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 597002, gadget_id = 71700105, pos = { x = -101.962, y = 17.568, z = 5072.99 }, rot = { x = 25.624, y = 340.957, z = -0.001 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 597003, gadget_id = 70210101, pos = { x = -102.309, y = 18.391, z = 5071.871 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 597006, 597005, 597004 },
	gadgets = { 597003, 597002, 597001 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
