-- 基础信息
local base_info = {
    group_id = 133307672
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 672001, gadget_id = 70330427, pos = { x = -1352.686, y = 5.735, z = 5759.232 }, rot = { x = 353.907, y = 347.403, z = 357.091 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 672002, gadget_id = 70330429, pos = { x = -1352.72, y = 5.717, z = 5758.844 }, rot = { x = 319.16, y = 195.787, z = 50.827 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 672003, gadget_id = 70330429, pos = { x = -1323.306, y = 11.306, z = 5776.919 }, rot = { x = 338.066, y = 270.645, z = 67.265 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 672004, gadget_id = 70330428, pos = { x = -1302.53, y = 15.11, z = 5760.59 }, rot = { x = 335.966, y = 0.187, z = 359.542 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 672005, gadget_id = 70330427, pos = { x = -1301.94, y = 15.16, z = 5759.77 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 672006, gadget_id = 70330429, pos = { x = -1237.827, y = 25.111, z = 5802.316 }, rot = { x = 359.333, y = 118.309, z = 76.057 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 672007, gadget_id = 70330427, pos = { x = -1216.325, y = 24.974, z = 5802.055 }, rot = { x = 55.851, y = 152.839, z = 33.263 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 672008, gadget_id = 70330428, pos = { x = -1217.591, y = 25.221, z = 5799.385 }, rot = { x = 347.392, y = 179.059, z = 45.165 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 672008, 672007, 672006, 672004, 672005, 672003, 672002, 672001 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
