-- 基础信息
local base_info = {
    group_id = 133314127
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 127001, gadget_id = 70211001, pos = { x = -783.760, y = -90.937, z = 4465.429 }, rot = { x = 0.000, y = 25.211, z = 0.000 }, level = 26, drop_tag = "战斗低级须弥", isOneoff = true, persistent = true, explore = { name = "chest", exp = 10 }, area_id = 32 },
	{ config_id = 127002, gadget_id = 70290636, pos = { x = -901.035, y = 53.031, z = 4506.854 }, rot = { x = 5.425, y = 122.7, z = 12.793 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 127003, gadget_id = 70290637, pos = { x = -901.625, y = 52.215, z = 4514.398 }, rot = { x = 12.71, y = 33.783, z = 353.747 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 127005, gadget_id = 70290635, pos = { x = -900.242, y = 52.051, z = 4513.042 }, rot = { x = 13.933, y = 50.201, z = 357.556 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 127006, gadget_id = 70290675, pos = { x = -867.889, y = 58.847, z = 4462.556 }, rot = { x = 12.682, y = 337.991, z = 340.617 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 127007, gadget_id = 70290688, pos = { x = -866.387, y = 58.119, z = 4463.582 }, rot = { x = 14.443, y = 346.583, z = 342.05 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 127008, gadget_id = 70290689, pos = { x = -875.056, y = 58.777, z = 4573.443 }, rot = { x = 12.933, y = 219.718, z = 350.516 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 127009, gadget_id = 70290685, pos = { x = -873.833, y = 59.052, z = 4572.731 }, rot = { x = 15.171, y = 232.8, z = 354.766 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 127010, gadget_id = 70290601, pos = { x = -867.889, y = 58.847, z = 4462.556 }, rot = { x = 12.682, y = 337.991, z = 340.617 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 127002, 127001, 127006, 127007, 127010, 127005, 127003, 127008, 127009 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
