-- 基础信息
local base_info = {
    group_id = 133308883
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 883001, monster_id = 25210301, pos = { x = -1482.438, y = 75.97, z = 5046.139 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 883002, monster_id = 25210301, pos = { x = -1479.259, y = 76.629, z = 5042.232 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 883003, monster_id = 25310301, pos = { x = -1489.368, y = 80.599, z = 5034.286 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", disableWander = true, area_id = 32 },
	{ config_id = 883004, monster_id = 25210203, pos = { x = -1471.864, y = 77.542, z = 5027.287 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 883005, gadget_id = 71700434, pos = { x = -1476.607, y = 79.807, z = 5022.587 }, rot = { x = 2.732, y = 0.204, z = 346.832 }, level = 32, area_id = 32 },
	{ config_id = 883006, gadget_id = 71700434, pos = { x = -1474.669, y = 79.447, z = 5018.547 }, rot = { x = 354.885, y = 327.977, z = 348.622 }, level = 32, area_id = 32 },
	{ config_id = 883007, gadget_id = 70210101, pos = { x = -1475.598, y = 79.965, z = 5019.008 }, rot = { x = 339.413, y = 322.097, z = 323.457 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 883008, gadget_id = 70210101, pos = { x = -1477.142, y = 79.912, z = 5023.368 }, rot = { x = 0.078, y = 356.927, z = 345.099 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 883009, gadget_id = 71700442, pos = { x = -1484.881, y = 76.441, z = 5044.415 }, rot = { x = 12.407, y = 2.704, z = 358.831 }, level = 32, area_id = 32 },
	{ config_id = 883010, gadget_id = 71700442, pos = { x = -1481.043, y = 77.266, z = 5041.06 }, rot = { x = 358.45, y = 344.299, z = 3.306 }, level = 32, area_id = 32 },
	{ config_id = 883011, gadget_id = 70330342, pos = { x = -1496.923, y = 80.962, z = 5036.104 }, rot = { x = 6.477, y = 93.306, z = 0.199 }, level = 26, drop_tag = "摩拉石箱须弥", isOneoff = true, persistent = true, explore = { name = "chest", exp = 4 }, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 883001, 883002, 883003, 883004 },
	gadgets = { 883005, 883006, 883007, 883008, 883009, 883010, 883011 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
