-- 基础信息
local base_info = {
    group_id = 133307633
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 633001, gadget_id = 70290635, pos = { x = -1099.476, y = 73.357, z = 5603.666 }, rot = { x = 351.443, y = 85.185, z = 4.264 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633002, gadget_id = 70290636, pos = { x = -1099.145, y = 72.858, z = 5605.98 }, rot = { x = 351.466, y = 82.664, z = 16.676 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633003, gadget_id = 70290637, pos = { x = -1101.072, y = 71.879, z = 5607.905 }, rot = { x = 2.198, y = 51.065, z = 20.329 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633007, gadget_id = 70290635, pos = { x = -1115.233, y = 70.5, z = 5601.111 }, rot = { x = 13.258, y = 270.283, z = 346.384 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633008, gadget_id = 70290636, pos = { x = -1114.794, y = 70.94, z = 5599.185 }, rot = { x = 11.632, y = 259.823, z = 350.01 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633009, gadget_id = 70290683, pos = { x = -1169.512, y = 61.407, z = 5606.893 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633010, gadget_id = 70290688, pos = { x = -1166.291, y = 61.399, z = 5608.185 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633011, gadget_id = 70290684, pos = { x = -1062.223, y = 76.109, z = 5662.782 }, rot = { x = 346.866, y = 200.57, z = 330.148 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633012, gadget_id = 70290680, pos = { x = -1067.271, y = 74.17, z = 5661.966 }, rot = { x = 350.217, y = 200.087, z = 333.555 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633013, gadget_id = 70290682, pos = { x = -1071.142, y = 72.204, z = 5662.058 }, rot = { x = 354.139, y = 186.206, z = 335.048 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 633014, gadget_id = 70290602, pos = { x = -1069.535, y = 72.649, z = 5664.146 }, rot = { x = 336.014, y = 144.067, z = 343.345 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 633014, 633013, 633012, 633011, 633003, 633002, 633001, 633008, 633007, 633009, 633010 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
