-- 基础信息
local base_info = {
    group_id = 133313462
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 462001, gadget_id = 70330335, pos = { x = -985.16, y = 80.632, z = 5540.752 }, rot = { x = 348.953, y = 358.825, z = 12.108 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 462002, gadget_id = 70330335, pos = { x = -964.413, y = 84.387, z = 5521.982 }, rot = { x = 10.799, y = 359.377, z = 12.217 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 462003, gadget_id = 70330335, pos = { x = -956.869, y = 87.227, z = 5546.008 }, rot = { x = 347.767, y = 359.235, z = 7.127 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 462004, gadget_id = 70330335, pos = { x = -943.937, y = 89.102, z = 5524.576 }, rot = { x = 8.622, y = 1.163, z = 15.335 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 462005, gadget_id = 70330335, pos = { x = -937.037, y = 91.035, z = 5547.194 }, rot = { x = 346.728, y = 358.445, z = 11.501 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 462010, gadget_id = 70310007, pos = { x = -983.678, y = 76.688, z = 5537.272 }, rot = { x = 9.364, y = 157.052, z = 350.389 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 462011, gadget_id = 70310007, pos = { x = -942.738, y = 85.721, z = 5527.168 }, rot = { x = 22.651, y = 342.779, z = 6.966 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 462012, gadget_id = 70210101, pos = { x = -984.257, y = 78.822, z = 5536.925 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 462013, gadget_id = 70210101, pos = { x = -942.903, y = 87.465, z = 5527.756 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 462014, gadget_id = 70210101, pos = { x = -922.087, y = 90.282, z = 5530.942 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 462014, 462013, 462011, 462004, 462005, 462002, 462003, 462012, 462010, 462001 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
