-- 基础信息
local base_info = {
    group_id = 133314483
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 483001, gadget_id = 70220103, pos = { x = -962.394, y = 187.443, z = 4989.631 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 483002, gadget_id = 70220103, pos = { x = -846.648, y = 152.488, z = 4877.033 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 483004, gadget_id = 70220103, pos = { x = -840.316, y = 170.401, z = 4917.792 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 483005, gadget_id = 70220103, pos = { x = -831.853, y = 191.156, z = 4917.983 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 483006, gadget_id = 70220103, pos = { x = -829.183, y = 218.371, z = 4938.151 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 483007, gadget_id = 70220103, pos = { x = -926.3, y = 199.168, z = 4964.898 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 483008, gadget_id = 70220103, pos = { x = -758.184, y = 214.819, z = 4944.534 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 483009, gadget_id = 70220103, pos = { x = -833.7, y = 221.252, z = 4992.537 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 483010, gadget_id = 70220103, pos = { x = -997.016, y = 162.96, z = 5000.863 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 483011, gadget_id = 70220103, pos = { x = -946.26, y = 184.363, z = 4962.005 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 483010, 483001, 483011, 483007, 483002, 483004, 483009, 483005, 483006, 483008 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
