-- 基础信息
local base_info = {
    group_id = 133314015
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 15001, gadget_id = 70350433, pos = { x = -402.036, y = 143.448, z = 4488.097 }, rot = { x = 29.03, y = 64.816, z = 34.133 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 15002, gadget_id = 70350432, pos = { x = -387.555, y = 155.587, z = 4433.302 }, rot = { x = 28.562, y = 315.511, z = 358.444 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 15003, gadget_id = 70350433, pos = { x = -442.877, y = 147.181, z = 4449.91 }, rot = { x = 338.961, y = 32.259, z = 30.603 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 15004, gadget_id = 70220103, pos = { x = -507.501, y = 96.739, z = 4418.035 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 15005, gadget_id = 70220103, pos = { x = -470.667, y = 124.086, z = 4413.547 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 15006, gadget_id = 70220103, pos = { x = -529.805, y = 82.669, z = 4431.412 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 15007, gadget_id = 70220103, pos = { x = -556.054, y = 66.928, z = 4445.357 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 15008, gadget_id = 70220103, pos = { x = -484.01, y = 113.324, z = 4404.983 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 15009, gadget_id = 70220103, pos = { x = -456.442, y = 132.658, z = 4424.35 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 15002, 15007, 15006, 15004, 15008, 15009, 15005, 15003, 15001 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
