-- 基础信息
local base_info = {
    group_id = 133314646
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 646001, gadget_id = 70290635, pos = { x = -594.887, y = 228.076, z = 4995.031 }, rot = { x = 7.611, y = 273.418, z = 20.821 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646002, gadget_id = 70290636, pos = { x = -599.89, y = 229.308, z = 5000.604 }, rot = { x = 15.82, y = 166.528, z = 344.265 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646003, gadget_id = 70290637, pos = { x = -604.163, y = 226.005, z = 4994.752 }, rot = { x = 340.244, y = 64.314, z = 345.334 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646004, gadget_id = 70211122, pos = { x = -599.688, y = 227.289, z = 4995.317 }, rot = { x = 353.248, y = 101.063, z = 335.777 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646005, gadget_id = 70330430, pos = { x = -596.469, y = 236.786, z = 5020.307 }, rot = { x = 344.712, y = 354.845, z = 25.552 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646006, gadget_id = 70290684, pos = { x = -586.07, y = 228.415, z = 4992.777 }, rot = { x = 8.062, y = 297.352, z = 20.237 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646007, gadget_id = 70290688, pos = { x = -597.154, y = 236.639, z = 5020.378 }, rot = { x = 16.06, y = 184.289, z = 334.537 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646008, gadget_id = 70290637, pos = { x = -598.971, y = 225.561, z = 4990.416 }, rot = { x = 341.011, y = 356.433, z = 13.623 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646009, gadget_id = 70290689, pos = { x = -631.153, y = 223.757, z = 4985.282 }, rot = { x = 353.99, y = 68.055, z = 359.183 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646010, gadget_id = 70290689, pos = { x = -599.421, y = 221.117, z = 4976.405 }, rot = { x = 341.666, y = 16.14, z = 13.129 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 646013, gadget_id = 70290602, pos = { x = -600.617, y = 227.327, z = 4995.899 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 646004, 646009, 646010, 646008, 646003, 646002, 646013, 646001, 646007, 646005, 646006 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
