-- 基础信息
local base_info = {
    group_id = 133308777
}
    
--================================================================
-- 
-- 配置
-- 
--================================================================
    
-- 怪物
monsters = {
	{ config_id = 777011, monster_id = 25210201, pos = { x = -789.094, y = 91.347, z = 4591.121 }, rot = { x = 0.000, y = 40.592, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9504, area_id = 32 },
	{ config_id = 777012, monster_id = 25310201, pos = { x = -788.573, y = 91.577, z = 4593.297 }, rot = { x = 0.000, y = 278.268, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", pose_id = 9001, area_id = 32 },
	{ config_id = 777013, monster_id = 25210201, pos = { x = -790.264, y = 90.991, z = 4594.725 }, rot = { x = 0.000, y = 106.750, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9504, area_id = 32 }
}
    
-- NPC
npcs = {
}
    
-- 装置
gadgets = {
    { config_id = 777001, gadget_id = 70520001, pos = { x = -1177.104, y = 78.224, z = 5158.28 }, rot = { x = 331.964, y = 65.126, z = 2.033 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 777002, gadget_id = 70520001, pos = { x = -1170.262, y = 79.948, z = 5147.115 }, rot = { x = 1.678, y = 0.295, z = 19.969 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 777003, gadget_id = 70520001, pos = { x = -1176.34, y = 77.883, z = 5152.504 }, rot = { x = 337.374, y = 78.624, z = 359.377 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 777004, gadget_id = 70310004, pos = { x = -789.893, y = 91.074, z = 4592.892 }, rot = { x = 357.435, y = 359.449, z = 24.243 }, level = 32, area_id = 32 },
	{ config_id = 777005, gadget_id = 70520001, pos = { x = -1215.209, y = 79.063, z = 5159.025 }, rot = { x = 359.604, y = 358.214, z = 11.286 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 777006, gadget_id = 70520001, pos = { x = -1211.266, y = 76.766, z = 5158.007 }, rot = { x = 19.896, y = 356.075, z = 337.889 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 777007, gadget_id = 70520003, pos = { x = -1212.084, y = 76.485, z = 5159.326 }, rot = { x = 24.908, y = 90.537, z = 23.226 }, level = 32, point_type = 1003, area_id = 32 },
	{ config_id = 777008, gadget_id = 70520003, pos = { x = -1177.188, y = 78.059, z = 5157.245 }, rot = { x = 355.207, y = 358.868, z = 26.566 }, level = 32, point_type = 1003, area_id = 32 },
	{ config_id = 777009, gadget_id = 70520003, pos = { x = -1178.012, y = 77.489, z = 5155.547 }, rot = { x = 19.4, y = 273.912, z = 6.354 }, level = 32, point_type = 1003, area_id = 32 },
	{ config_id = 777010, gadget_id = 70520003, pos = { x = -1176.75, y = 77.848, z = 5153.907 }, rot = { x = 15.158, y = 306.485, z = 17.01 }, level = 32, point_type = 1003, area_id = 32 }
}
    
-- 区域
regions = {
}
    
-- 触发器
triggers = {
}
    
-- 变量
variables = {
}
    
--================================================================
-- 
-- 初始化配置
-- 
--================================================================
    
-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}
    
--================================================================
-- 
-- 小组配置
-- 
--================================================================
    
suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 777011, 777012, 777013 },
		gadgets = { 777004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	},
	{
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 777007, 777005, 777004, 777006, 777010, 777009, 777008, 777003, 777001, 777002 },
	regions = { },
	triggers = { },
	rand_weight = 100
	}
}
    
--================================================================
-- 
-- 触发器
-- 
--================================================================
     