-- 基础信息
local base_info = {
    group_id = 133307628
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 628001, gadget_id = 70210101, pos = { x = -1357.004, y = 38.191, z = 5209.683 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 628002, gadget_id = 71700105, pos = { x = -1358.883, y = 36.87, z = 5215.27 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 628003, gadget_id = 70300094, pos = { x = -1359.343, y = 37.036, z = 5210.024 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 628004, gadget_id = 70710548, pos = { x = -1361.205, y = 36.88, z = 5216.079 }, rot = { x = 0.434, y = 19.363, z = 359.609 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 628005, gadget_id = 70210101, pos = { x = -1361.294, y = 37.328, z = 5215.96 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 628001, 628002, 628003, 628004, 628005 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
