-- 基础信息
local base_info = {
    group_id = 133307612
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 612001, gadget_id = 70290635, pos = { x = -1351.919, y = -42.762, z = 5680.832 }, rot = { x = 7.309, y = 208.03, z = 352.486 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 612002, gadget_id = 70290636, pos = { x = -1354.637, y = -42.951, z = 5688.541 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 612003, gadget_id = 70290637, pos = { x = -1344.738, y = -40.007, z = 5681.246 }, rot = { x = 352.419, y = 159.573, z = 349.502 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 612007, gadget_id = 70290637, pos = { x = -1350.403, y = -41.266, z = 5694.014 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 612008, gadget_id = 70290635, pos = { x = -1343.099, y = -39.741, z = 5692.881 }, rot = { x = 344.645, y = 42.283, z = 2.64 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 612009, gadget_id = 70290636, pos = { x = -1340.794, y = -38.96, z = 5686.565 }, rot = { x = 340.747, y = 90.399, z = 9.145 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 612010, gadget_id = 70290685, pos = { x = -1371.432, y = -46.86, z = 5653.596 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 612011, gadget_id = 70290691, pos = { x = -1338.594, y = -26.627, z = 5661.954 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 612012, gadget_id = 70290683, pos = { x = -1331.177, y = -30.228, z = 5714.46 }, rot = { x = 352.586, y = 32.375, z = 13.401 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 612013, gadget_id = 70290689, pos = { x = -1304.781, y = -20.751, z = 5682.027 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 612002, 612007, 612008, 612012, 612001, 612003, 612009, 612013, 612010, 612011 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
