-- 基础信息
local base_info = {
    group_id = 133308794
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 794002, monster_id = 25210103, pos = { x = -1344.339, y = 55.27, z = 5037.197 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", disableWander = true, pose_id = 9003, area_id = 32 },
	{ config_id = 794003, monster_id = 25210203, pos = { x = -1343.326, y = 55.27, z = 5037.939 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 794005, monster_id = 25210301, pos = { x = -1349.572, y = 55.253, z = 5038.558 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 794001, gadget_id = 70220128, pos = { x = -1343.858, y = 55.147, z = 5037.726 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 794008, gadget_id = 70310006, pos = { x = -1352.088, y = 55.365, z = 5034.071 }, rot = { x = 4.818, y = 37.007, z = 337.119 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 794009, gadget_id = 70330396, pos = { x = -1347.053, y = 55.154, z = 5034.459 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 794002, 794003, 794005 },
	gadgets = { 794006, 794008, 794001, 794009 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
