-- 基础信息
local base_info = {
    group_id = 133313395
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 395003, monster_id = 25310301, pos = { x = -1050.956, y = 31.749, z = 5761.197 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", disableWander = true, area_id = 32 },
	{ config_id = 395004, monster_id = 25210301, pos = { x = -1054.62, y = 31.048, z = 5757.819 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 395005, monster_id = 25210201, pos = { x = -1052.907, y = 32.311, z = 5765.514 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 395006, monster_id = 28060901, pos = { x = -1057.016, y = 31.219, z = 5761.167 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "驮兽镀金旅团", disableWander = true, pose_id = 1, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 395001, gadget_id = 70710408, pos = { x = -1052.305, y = 31.212, z = 5757.665 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 395002, gadget_id = 70710408, pos = { x = -1050.387, y = 32.417, z = 5764.908 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 395007, gadget_id = 70330396, pos = { x = -1053.729, y = 31, z = 5754.774 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 395008, gadget_id = 70330396, pos = { x = -1049.814, y = 32.928, z = 5767.14 }, rot = { x = 355.456, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 395003, 395004, 395005, 395006 },
	gadgets = { 395001, 395002, 395007, 395008 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
