-- 基础信息
local base_info = {
    group_id = 133313253
}
    
--================================================================
-- 
-- 配置
-- 
--================================================================
    
-- 怪物
monsters = {
	{ config_id = 253007, monster_id = 24030201, pos = { x = -334.270, y = 127.621, z = 5956.499 }, rot = { x = 0.000, y = 263.017, z = 0.000 }, level = 32, drop_tag = "遗迹龙兽", pose_id = 101, area_id = 32 },
	{ config_id = 253008, monster_id = 24030101, pos = { x = -307.280, y = 138.728, z = 5905.113 }, rot = { x = 0.000, y = 336.034, z = 0.000 }, level = 32, drop_tag = "遗迹龙兽", pose_id = 102, area_id = 32 }
}
    
-- NPC
npcs = {
}
    
-- 装置
gadgets = {
    { config_id = 253001, gadget_id = 70540046, pos = { x = -215.458, y = 146.398, z = 5535.026 }, rot = { x = 318.213, y = 34.135, z = 21.971 }, level = 32, point_type = 1004, area_id = 32 },
	{ config_id = 253002, gadget_id = 70540046, pos = { x = -214.659, y = 145.791, z = 5532.716 }, rot = { x = 332.861, y = 17.758, z = 19.755 }, level = 32, point_type = 1004, area_id = 32 },
	{ config_id = 253003, gadget_id = 70540046, pos = { x = -339.464, y = 135.385, z = 5466.411 }, rot = { x = 340.58, y = 320.509, z = 319.204 }, level = 32, point_type = 1004, area_id = 32 },
	{ config_id = 253004, gadget_id = 70540046, pos = { x = -409.25, y = 142.359, z = 5516.663 }, rot = { x = 354.196, y = 326.861, z = 324.342 }, level = 32, point_type = 1004, area_id = 32 },
	{ config_id = 253005, gadget_id = 70540046, pos = { x = -261.742, y = 103.613, z = 5350.027 }, rot = { x = 30.591, y = 99.637, z = 334.271 }, level = 32, point_type = 1004, area_id = 32 },
	{ config_id = 253006, gadget_id = 70540046, pos = { x = -147.002, y = 51.427, z = 5240.36 }, rot = { x = 22.434, y = 141.581, z = 317.425 }, level = 32, point_type = 1004, area_id = 32 }
}
    
-- 区域
regions = {
}
    
-- 触发器
triggers = {
}
    
-- 变量
variables = {
}
    
--================================================================
-- 
-- 初始化配置
-- 
--================================================================
    
-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}
    
--================================================================
-- 
-- 小组配置
-- 
--================================================================
    
suites = {
	{
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 253006, 253005, 253003, 253004, 253002, 253001 },
	regions = { },
	triggers = { },
	rand_weight = 100
	},
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 253007, 253008 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
    
--================================================================
-- 
-- 触发器
-- 
--================================================================
     