-- 基础信息
local base_info = {
    group_id = 133313313
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 313001, monster_id = 25210303, pos = { x = -649.971, y = 158.977, z = 5543.574 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 313002, monster_id = 25310101, pos = { x = -647.779, y = 158.929, z = 5544.317 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", disableWander = true, area_id = 32 },
	{ config_id = 313003, monster_id = 25310201, pos = { x = -645.367, y = 158.94, z = 5542.735 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", pose_id = 9003, area_id = 32 },
	{ config_id = 313004, monster_id = 28060901, pos = { x = -646.358, y = 158.434, z = 5534.83 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "驮兽镀金旅团", disableWander = true, pose_id = 1, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 313006, gadget_id = 70220048, pos = { x = -644.47, y = 158.899, z = 5540.134 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 313007, gadget_id = 70220050, pos = { x = -647.13, y = 158.948, z = 5549.641 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 313008, gadget_id = 70220052, pos = { x = -651.017, y = 158.688, z = 5545.649 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 313009, gadget_id = 70210101, pos = { x = -644.559, y = 159.219, z = 5539.507 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 313010, gadget_id = 70210101, pos = { x = -650.904, y = 159.045, z = 5545.556 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 313004, 313003, 313002, 313001 },
	gadgets = { 313010, 313009, 313008, 313006, 313007 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
