-- 基础信息
local base_info = {
    group_id = 133314480
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 480001, gadget_id = 70330254, pos = { x = -720.518, y = 235.25, z = 5015.807 }, rot = { x = 346.813, y = 46.345, z = 5.228 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 480002, gadget_id = 70330254, pos = { x = -794.532, y = 221.287, z = 4981.073 }, rot = { x = 19.531, y = 296.351, z = 355.26 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 480003, gadget_id = 70330254, pos = { x = -858.254, y = 198.191, z = 5011.06 }, rot = { x = 340.31, y = 78.171, z = 346.228 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 480003, gadget_id = 70330254, pos = { x = -850.9484, y = 201.25037, z = 5012.5903 }, rot = { x = 340.31, y = 78.171, z = 346.228 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 480004, gadget_id = 70330254, pos = { x = -845.695, y = 214.103, z = 4985.493 }, rot = { x = 27.148, y = 272.787, z = 3.127 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 480005, gadget_id = 70330254, pos = { x = -661.266, y = 218.182, z = 4986.495 }, rot = { x = 13.862, y = 198.099, z = 357.173 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 480006, gadget_id = 70330254, pos = { x = -614.415, y = 232.962, z = 5024.296 }, rot = { x = 17.409, y = 181.361, z = 357.845 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 480007, gadget_id = 70330254, pos = { x = -573.007, y = 248.698, z = 5081.37 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 480003, 480004, 480003, 480002, 480001, 480005, 480006, 480007 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
