-- 基础信息
local base_info = {
    group_id = 133307614
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 614001, monster_id = 24010101, pos = { x = -1366.36, y = -47.985, z = 5654.8 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "遗迹守卫", pose_id = 101, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 614002, gadget_id = 70310007, pos = { x = -1359.798, y = -48.006, z = 5654.551 }, rot = { x = 339.445, y = 313.32, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 614003, gadget_id = 70310007, pos = { x = -1371.331, y = -45.803, z = 5650.225 }, rot = { x = 338.537, y = 81.762, z = 29.111 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 614004, gadget_id = 70210101, pos = { x = -1372.613, y = -44.204, z = 5651.398 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 614005, gadget_id = 70210101, pos = { x = -1358.932, y = -46.231, z = 5653.837 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 614001 },
	gadgets = { 614004, 614005, 614003, 614002 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
