-- 基础信息
local base_info = {
    group_id = 133313387
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 387001, monster_id = 28061501, pos = { x = -738.751, y = 95.275, z = 5679.681 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "鸟类", pose_id = 1, area_id = 32},
	{ config_id = 387002, monster_id = 21010101, pos = { x = -737.739, y = 95.402, z = 5677.373 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "丘丘人", pose_id = 9016, area_id = 32 },
	{ config_id = 387008, monster_id = 25310301, pos = { x = -811.922, y = 77.488, z = 5691.26 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", disableWander = true, area_id = 32 },
	{ config_id = 387009, monster_id = 28060503, pos = { x = -1033.658, y = 31.017, z = 5757.057 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "走兽", pose_id = 1, area_id = 32 },
	{ config_id = 387010, monster_id = 28050106, pos = { x = -1022.052, y = 40.909, z = 5791.337 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 32 },
	{ config_id = 387011, monster_id = 28050106, pos = { x = -1013.467, y = 40.892, z = 5717.851 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 30, drop_tag = "魔法生物", area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 387003, gadget_id = 70710548, pos = { x = -736.032, y = 95.719, z = 5676.248 }, rot = { x = 340.816, y = 209.628, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 387004, gadget_id = 70710331, pos = { x = -738.308, y = 95.24, z = 5678.207 }, rot = { x = 0.032, y = 321.017, z = 5.714 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 387005, gadget_id = 70310004, pos = { x = -735.28, y = 95.661, z = 5677.312 }, rot = { x = 12.877, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 387006, gadget_id = 70710247, pos = { x = -738.147, y = 95.528, z = 5676.486 }, rot = { x = 29.892, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 387007, gadget_id = 70220026, pos = { x = -733.081, y = 96.284, z = 5683.632 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 387002, 387001, 387008, 387009, 387011, 387010 },
	gadgets = { 387006, 387004, 387003, 387005, 387007 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
