-- 基础信息
local base_info = {
	group_id = 133307240
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 240002, gadget_id = 70330254, pos = { x = -1336.889, y = 45.097, z = 5272.418 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 240004, gadget_id = 70330254, pos = { x = -1314.106, y = 44.520, z = 5316.821 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 240005, gadget_id = 70330254, pos = { x = -1275.468, y = 42.084, z = 5323.224 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 240008, gadget_id = 70330254, pos = { x = -1314.533, y = 47.567, z = 5345.736 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 240011, gadget_id = 70330254, pos = { x = -1269.055, y = 40.386, z = 5357.409 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 240010, gadget_id = 70330254, pos = { x = -1267.5856, y = 42.967667, z = 5383.5996 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 240012, gadget_id = 70330254, pos = { x = -1344.526, y = 48.997, z = 5232.523 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

-- 废弃数据
garbages = {
	gadgets = {
		{ config_id = 240001, gadget_id = 70330254, pos = { x = -1333.167, y = 45.448, z = 5303.681 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 32 },
		{ config_id = 240003, gadget_id = 70330254, pos = { x = -1326.411, y = 46.000, z = 5322.945 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 32 },
		{ config_id = 240006, gadget_id = 70330254, pos = { x = -1294.603, y = 42.466, z = 5292.847 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 32 },
		{ config_id = 240007, gadget_id = 70330254, pos = { x = -1297.390, y = 45.299, z = 5328.673 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 32 },
		{ config_id = 240009, gadget_id = 70330254, pos = { x = -1325.656, y = 45.829, z = 5337.511 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, area_id = 32 }
	}
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { },
		gadgets = { 240002, 240004, 240005, 240008, 240010, 240011, 240012 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
