-- 基础信息
local base_info = {
    group_id = 133313388
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 388003, gadget_id = 70330450, pos = { x = -747.56, y = 92.088, z = 5688.219 }, rot = { x = 19.348, y = 3.541, z = 20.557 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 388004, gadget_id = 70330449, pos = { x = -747.56, y = 92.088, z = 5688.219 }, rot = { x = 19.348, y = 3.541, z = 20.557 }, level = 32, point_type = 3012, area_id = 32 },
	{ config_id = 388005, gadget_id = 70330450, pos = { x = -767.41, y = 84.034, z = 5700.88 }, rot = { x = 14.969, y = 2.002, z = 15.153 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 388006, gadget_id = 70330449, pos = { x = -767.41, y = 84.034, z = 5700.88 }, rot = { x = 14.969, y = 2.002, z = 15.153 }, level = 32, point_type = 3012, area_id = 32 },
	{ config_id = 388007, gadget_id = 70330450, pos = { x = -850.903, y = 60.773, z = 5717.379 }, rot = { x = 11.096, y = 2.101, z = 10.824 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 388008, gadget_id = 70330449, pos = { x = -850.903, y = 60.773, z = 5717.379 }, rot = { x = 11.097, y = 2.101, z = 10.824 }, level = 32, point_type = 3012, area_id = 32 },
	{ config_id = 388009, gadget_id = 70520001, pos = { x = -839.717, y = 81.044, z = 5684.907 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 388010, gadget_id = 70520001, pos = { x = -849.933, y = 80.127, z = 5685.246 }, rot = { x = 343.607, y = 148.224, z = 9.916 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 388011, gadget_id = 70520001, pos = { x = -838.419, y = 79.82, z = 5685.756 }, rot = { x = 354.792, y = 272.027, z = 305.792 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 388012, gadget_id = 70520002, pos = { x = -854.714, y = 73.122, z = 5689.701 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 1002, area_id = 32 },
	{ config_id = 388013, gadget_id = 70520002, pos = { x = -857.179, y = 70.713, z = 5691.995 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 1002, area_id = 32 },
	{ config_id = 388014, gadget_id = 70520002, pos = { x = -856.75, y = 74.032, z = 5688.739 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 1002, area_id = 32 },
	{ config_id = 388019, gadget_id = 70290003, pos = { x = -775.096, y = 61.09, z = 5723.052 }, rot = { x = 18.134, y = 0.571, z = 3.577 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 388020, gadget_id = 70540004, pos = { x = -775.096, y = 61.193, z = 5722.961 }, rot = { x = 18.134, y = 0.571, z = 3.577 }, level = 32, point_type = 3003, area_id = 32 },
	{ config_id = 388021, gadget_id = 70540004, pos = { x = -775.096, y = 61.193, z = 5723.153 }, rot = { x = 18.134, y = 0.571, z = 3.577 }, level = 32, point_type = 3003, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 388003, 388004, 388005, 388006, 388007, 388008, 388009, 388010, 388011, 388012, 388013, 388014, 388019, 388020, 388021 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
