-- 基础信息
local base_info = {
    group_id = 133308911
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 911001, gadget_id = 70220103, pos = { x = -1257.901, y = 80.516, z = 4966.335 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 911002, gadget_id = 70220103, pos = { x = -1222.565, y = 76.731, z = 4985.378 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 911003, gadget_id = 70220103, pos = { x = -1212.618, y = 88.52, z = 4986.603 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 911004, gadget_id = 70220103, pos = { x = -1191.386, y = 88.446, z = 4960.431 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 911005, gadget_id = 70220103, pos = { x = -1177.7, y = 103.334, z = 4952.057 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 911006, gadget_id = 70220103, pos = { x = -1169.294, y = 79.185, z = 4983.991 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 911007, gadget_id = 70220103, pos = { x = -1144.583, y = 81.402, z = 4984.522 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 911003, 911002, 911006, 911007, 911001, 911005, 911004 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
