-- 基础信息
local base_info = {
    group_id = 133308717
}
    
--================================================================
-- 
-- 配置
-- 
--================================================================
    
-- 怪物
monsters = {
	{ config_id = 717006, monster_id = 25410102, pos = { x = -1116.859, y = 125.526, z = 4901.772 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "高级镀金旅团", area_id = 32 },
	{ config_id = 717007, monster_id = 25310301, pos = { x = -1095.753, y = 131.428, z = 4928.227 }, rot = { x = 0.000, y = 213.781, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", area_id = 32 }
}
    
-- NPC
npcs = {
}
    
-- 装置
gadgets = {
    { config_id = 717001, gadget_id = 70520001, pos = { x = -1406.296, y = 74.642, z = 4920.987 }, rot = { x = 348.603, y = 28.937, z = 7.733 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 717002, gadget_id = 70520001, pos = { x = -1406.381, y = 74.283, z = 4919.021 }, rot = { x = 16.978, y = 155.611, z = 353.384 }, level = 32, point_type = 1001, area_id = 32 },
	{ config_id = 717003, gadget_id = 70520003, pos = { x = -1375.88, y = 86.276, z = 4915.837 }, rot = { x = 351.671, y = 74.63, z = 20.579 }, level = 32, point_type = 1003, area_id = 32 },
	{ config_id = 717004, gadget_id = 70520003, pos = { x = -1374.648, y = 86.632, z = 4915.747 }, rot = { x = 22.177, y = 0.875, z = 12.676 }, level = 32, point_type = 1003, area_id = 32 },
	{ config_id = 717005, gadget_id = 70520003, pos = { x = -1373.822, y = 86.987, z = 4915.384 }, rot = { x = 355.494, y = 69.646, z = 25.007 }, level = 32, point_type = 1003, area_id = 32 }
}
    
-- 区域
regions = {
}
    
-- 触发器
triggers = {
}
    
-- 变量
variables = {
}
    
--================================================================
-- 
-- 初始化配置
-- 
--================================================================
    
-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}
    
--================================================================
-- 
-- 小组配置
-- 
--================================================================
    
suites = {
	{
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 717002, 717001, 717005, 717003, 717004 },
	regions = { },
	triggers = { },
	rand_weight = 100
	},
	{
		-- suite_id = 2,
		-- description = ,
		monsters = { 717006, 717007 },
		gadgets = { },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
    
--================================================================
-- 
-- 触发器
-- 
--================================================================
     