-- 基础信息
local base_info = {
    group_id = 133314410
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 410001, gadget_id = 70290635, pos = { x = -1040.863, y = 66.731, z = 4785.282 }, rot = { x = 20.811, y = 67.312, z = 340.565 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 410002, gadget_id = 70290637, pos = { x = -1040.848, y = 67.276, z = 4787.924 }, rot = { x = 8.211, y = 97.426, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 410003, gadget_id = 70290636, pos = { x = -1030.517, y = 67.776, z = 4813.475 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 410004, gadget_id = 70290683, pos = { x = -1045.133, y = 64.058, z = 4755.063 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 410007, gadget_id = 70290635, pos = { x = -1028.703, y = 68.02, z = 4814.594 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 410008, gadget_id = 70290686, pos = { x = -1043.564, y = 63.955, z = 4755.002 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 410009, gadget_id = 70290687, pos = { x = -1026.24, y = 70.842, z = 4836.066 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 410010, gadget_id = 70290684, pos = { x = -1027.198, y = 70.947, z = 4837.881 }, rot = { x = 4.603, y = 103.422, z = 351.525 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 410001, 410002, 410003, 410004, 410007, 410008, 410009, 410010 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
