-- 基础信息
local base_info = {
    group_id = 133308820
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 820001, monster_id = 24040101, pos = { x = -1280.618, y = 64.821, z = 4764.594 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "元能构装体", pose_id = 1004, area_id = 32 },
	{ config_id = 820004, monster_id = 24040301, pos = { x = -1255.932, y = 64.112, z = 4763.715 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "元能构装体", pose_id = 1004, area_id = 32 },
	{ config_id = 820008, monster_id = 24040201, pos = { x = -1267.99, y = 63.8, z = 4745.657 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "元能构装体", pose_id = 1004, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 820005, gadget_id = 70330432, pos = { x = -1249.909, y = 65.163, z = 4760.697 }, rot = { x = 287.153, y = 306.917, z = 9.015 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 820006, gadget_id = 70330432, pos = { x = -1249.221, y = 64.4, z = 4767.547 }, rot = { x = 340.106, y = 229.704, z = 354.32 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 820007, gadget_id = 70330432, pos = { x = -1285.228, y = 65.165, z = 4759.991 }, rot = { x = 314.732, y = 51.282, z = 358.266 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 820009, gadget_id = 70330432, pos = { x = -1265.015, y = 64.738, z = 4741.829 }, rot = { x = 302.36, y = 306.81, z = -0.002 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 820001, 820004, 820008 },
	gadgets = { 820005, 820006, 820007, 820009 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
