-- 基础信息
local base_info = {
    group_id = 133314496
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 496006, monster_id = 25210201, pos = { x = -467.986, y = 68.302, z = 4463.48 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 496001, gadget_id = 70310004, pos = { x = -466.863, y = 68.248, z = 4463.621 }, rot = { x = 1.924, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 496002, gadget_id = 70220052, pos = { x = -469.197, y = 68.17, z = 4460.63 }, rot = { x = 13.395, y = 5.672, z = 23.204 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 496003, gadget_id = 70330429, pos = { x = -467.791, y = 67.65, z = 4465.67 }, rot = { x = 338.977, y = 277.301, z = 60.893 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 496007, gadget_id = 70710136, pos = { x = -468.205, y = 68.326, z = 4462.241 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 496009, gadget_id = 70950135, pos = { x = -467.268, y = 68.299, z = 4461.34 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 496010, gadget_id = 70710548, pos = { x = -465.342, y = 68.216, z = 4462.076 }, rot = { x = 7.597, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 496011, gadget_id = 70710398, pos = { x = -468.101, y = 67.852, z = 4461.503 }, rot = { x = 2.427, y = 0.098, z = 359.505 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 496012, gadget_id = 71700519, pos = { x = -466.748, y = 68.414, z = 4461.827 }, rot = { x = 5.643, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 496006 },
	gadgets = { 496012, 496011, 496003, 496009, 496001, 496010, 496007, 496002 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
