-- 基础信息
local base_info = {
    group_id = 133314386
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 386001, monster_id = 21010201, pos = { x = -440.273, y = 255.987, z = 4952.862 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "丘丘人", pose_id = 9010, area_id = 32 },
	{ config_id = 386003, monster_id = 21010701, pos = { x = -459.801, y = 250.254, z = 4960.888 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "丘丘人", area_id = 32 },
	{ config_id = 386004, monster_id = 21010301, pos = { x = -439.465, y = 255.182, z = 4947.251 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "丘丘人", pose_id = 9010, area_id = 32 },
	{ config_id = 386005, monster_id = 21010401, pos = { x = -441.989, y = 253.499, z = 4945.637 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "远程丘丘人", pose_id = 9002, area_id = 32 },
	{ config_id = 386013, monster_id = 28060503, pos = { x = -459.198, y = 253.433, z = 4975.646 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "走兽", pose_id = 1, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 386006, gadget_id = 70300086, pos = { x = -436.013, y = 256.361, z = 4946.914 }, rot = { x = 6.451, y = 1.257, z = 11.05 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 386007, gadget_id = 70300086, pos = { x = -435.437, y = 257.865, z = 4952.815 }, rot = { x = 348.526, y = 0.002, z = 11.523 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 386011, gadget_id = 70220103, pos = { x = -434.32, y = 262.886, z = 4952.041 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 386012, gadget_id = 70310004, pos = { x = -441.573, y = 254.542, z = 4949.236 }, rot = { x = 347.669, y = 359.16, z = 28.558 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 386001, 386003, 386004, 386005, 386013 },
	gadgets = { 386006, 386007, 386011, 386012 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
