-- 基础信息
local base_info = {
    group_id = 133314657
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 657002, gadget_id = 70220103, pos = { x = -799.832, y = 224.996, z = 4973.697 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 657003, gadget_id = 70330404, pos = { x = -775.453, y = 224.315, z = 5003.348 }, rot = { x = 11.51, y = 253.754, z = 343.692 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 657004, gadget_id = 70330404, pos = { x = -834.671, y = 210.182, z = 4988.19 }, rot = { x = 23.175, y = 355.374, z = 3.127 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 657005, gadget_id = 70330404, pos = { x = -845.987, y = 209.845, z = 4972.285 }, rot = { x = 344.852, y = 355.978, z = 8.78 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 657006, gadget_id = 70330404, pos = { x = -808.198, y = 214.178, z = 5003.954 }, rot = { x = 11.955, y = 358.899, z = 21.212 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 657007, gadget_id = 70330435, pos = { x = -810.965, y = 218.485, z = 4971.12 }, rot = { x = 14.933, y = 352.689, z = 19.162 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 657008, gadget_id = 70330340, pos = { x = -773.68, y = 222.891, z = 5002.534 }, rot = { x = 357.473, y = 152.211, z = 330.792 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 657009, gadget_id = 70330340, pos = { x = -836.094, y = 208.795, z = 4988.886 }, rot = { x = 9.065, y = 49.527, z = 9.434 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 657010, gadget_id = 70330340, pos = { x = -845.19, y = 208.511, z = 4972.928 }, rot = { x = 336, y = 143.634, z = 344.114 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 657003, 657004, 657005, 657006, 657009, 657010, 657007, 657002, 657008 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
