-- 基础信息
local base_info = {
    group_id = 133314473
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 473001, monster_id = 28060901, pos = { x = -711.786, y = 245.354, z = 5051.579 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "驮兽镀金旅团", disableWander = true, pose_id = 1, area_id = 32 },
	{ config_id = 473003, monster_id = 25210303, pos = { x = -713.247, y = 244.52, z = 5049.301 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 473004, monster_id = 25210201, pos = { x = -724.279, y = 244.18, z = 5050.704 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 473005, monster_id = 25210303, pos = { x = -726.012, y = 244.268, z = 5049.771 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 473007, gadget_id = 70220128, pos = { x = -725.157, y = 244.102, z = 5050.212 }, rot = { x = 1.286, y = 153.157, z = 2.583 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 473011, gadget_id = 70220050, pos = { x = -733.568, y = 244.749, z = 5050.461 }, rot = { x = 0.01, y = 180.777, z = 5.472 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 473018, gadget_id = 70220051, pos = { x = -734.893, y = 244.845, z = 5050.861 }, rot = { x = 357.802, y = 344.587, z = 354.37 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 473021, gadget_id = 70220103, pos = { x = -735.558, y = 250.047, z = 5050.035 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 473005, 473004, 473003, 473001 },
	gadgets = { 473021, 473007, 473018, 473011 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
