-- 基础信息
local base_info = {
    group_id = 133313432
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 432001, gadget_id = 70290635, pos = { x = -505.027, y = 258.523, z = 5236.021 }, rot = { x = 7.38, y = 237.269, z = 351.617 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 432002, gadget_id = 70290636, pos = { x = -496.515, y = 263.541, z = 5226.095 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 432003, gadget_id = 70290635, pos = { x = -482.667, y = 264.944, z = 5225.85 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 432007, gadget_id = 70290636, pos = { x = -478.486, y = 264.78, z = 5234.192 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 432008, gadget_id = 70290676, pos = { x = -503.589, y = 265.479, z = 5237.928 }, rot = { x = 333.101, y = 86.224, z = 21.308 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 432011, gadget_id = 70290689, pos = { x = -496.683, y = 269.65, z = 5233.652 }, rot = { x = 359.499, y = 44.513, z = 30.904 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 432012, gadget_id = 70290686, pos = { x = -489.153, y = 272.189, z = 5232.301 }, rot = { x = 12.81, y = -0.001, z = 16.383 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 432013, gadget_id = 70290687, pos = { x = -486.287, y = 271.495, z = 5237.849 }, rot = { x = 13.405, y = 299.574, z = 350.68 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 432001, 432002, 432003, 432007, 432008, 432011, 432012, 432013 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
