-- 基础信息
local base_info = {
    group_id = 133313360
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 360001, gadget_id = 70330450, pos = { x = -706.856, y = 134.112, z = 5633.49 }, rot = { x = 22.291, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 360002, gadget_id = 70330449, pos = { x = -706.856, y = 134.112, z = 5633.49 }, rot = { x = 22.29, y = 0.000, z = 0.000 }, level = 32, point_type = 3012, area_id = 32 },
	{ config_id = 360003, gadget_id = 70330450, pos = { x = -708.071, y = 133.357, z = 5635.604 }, rot = { x = 4.561, y = 280.02, z = 335.76 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 360004, gadget_id = 70330449, pos = { x = -708.071, y = 133.357, z = 5635.604 }, rot = { x = 4.561, y = 280.021, z = 335.76 }, level = 32, point_type = 3012, area_id = 32 },
	{ config_id = 360005, gadget_id = 70330450, pos = { x = -773.367, y = 129.741, z = 5633.667 }, rot = { x = 36.129, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 360006, gadget_id = 70330449, pos = { x = -773.367, y = 129.741, z = 5633.667 }, rot = { x = 36.128, y = 0.000, z = 0.000 }, level = 32, point_type = 3012, area_id = 32 },
	{ config_id = 360007, gadget_id = 70330450, pos = { x = -742.331, y = 142.536, z = 5612.561 }, rot = { x = 20.863, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 360008, gadget_id = 70330449, pos = { x = -742.331, y = 142.536, z = 5612.561 }, rot = { x = 20.864, y = 0.000, z = 0.000 }, level = 32, point_type = 3012, area_id = 32 },
	{ config_id = 360009, gadget_id = 70330450, pos = { x = -732.667, y = 122.25, z = 5651.281 }, rot = { x = 24.193, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 360010, gadget_id = 70330449, pos = { x = -732.667, y = 122.25, z = 5651.281 }, rot = { x = 24.193, y = 0.000, z = 0.000 }, level = 32, point_type = 3012, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 360002, 360003, 360004, 360001, 360008, 360007, 360009, 360010, 360006, 360005 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
