-- 基础信息
local base_info = {
    group_id = 133314502
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 502001, monster_id = 25210301, pos = { x = -870.481, y = 203.724, z = 4982.062 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 502002, monster_id = 25210301, pos = { x = -873.324, y = 202.643, z = 4981.57 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 502003, monster_id = 25310301, pos = { x = -869.187, y = 205.872, z = 4974.476 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", disableWander = true, area_id = 32 },
	{ config_id = 502004, monster_id = 25210402, pos = { x = -859.156, y = 208.428, z = 4980.085 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 502005, gadget_id = 71700434, pos = { x = -874.722, y = 201.837, z = 4975.752 }, rot = { x = 17.551, y = 308.878, z = 13.665 }, level = 32, area_id = 32 },
	{ config_id = 502006, gadget_id = 70330428, pos = { x = -875.713, y = 201.177, z = 4974.544 }, rot = { x = 9.463, y = 330.696, z = 337.129 }, level = 32, area_id = 32 },
	{ config_id = 502007, gadget_id = 70210101, pos = { x = -875.864, y = 201.474, z = 4974.752 }, rot = { x = 15.702, y = 316.215, z = 15.768 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 502008, gadget_id = 70210101, pos = { x = -865.553, y = 205.793, z = 4979.539 }, rot = { x = 0.929, y = 357.798, z = 22.857 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 502010, gadget_id = 71700442, pos = { x = -869.267, y = 204.19, z = 4979.953 }, rot = { x = 0.054, y = 359.867, z = 22.111 }, level = 32, area_id = 32 },
	{ config_id = 502011, gadget_id = 71700442, pos = { x = -872.151, y = 203.042, z = 4978.986 }, rot = { x = 359.937, y = 0.144, z = 23.631 }, level = 32, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 502002, 502004, 502003, 502001 },
	gadgets = { 502006, 502007, 502011, 502010, 502008, 502005 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
