-- 基础信息
local base_info = {
    group_id = 133307721
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 721001, gadget_id = 70290765, pos = { x = -1208.983, y = 3.142, z = 5781.639 }, rot = { x = 0.209, y = 316.78, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 721002, gadget_id = 70290462, pos = { x = -1211.872, y = -9.66, z = 5779.327 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 721006, gadget_id = 70290462, pos = { x = -1209.317, y = -5.008, z = 5781.942 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 721007, gadget_id = 70290462, pos = { x = -1214.389, y = -6.111, z = 5776.426 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 721009, gadget_id = 70290462, pos = { x = -1206.64, y = -15.317, z = 5784.684 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 721010, gadget_id = 70290462, pos = { x = -1217.156, y = -15.321, z = 5774.035 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 721015, gadget_id = 70290765, pos = { x = -1214.392, y = 3.142, z = 5776.556 }, rot = { x = 0.209, y = 316.78, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 721009, 721006, 721001, 721002, 721015, 721010, 721007 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
