-- 基础信息
local base_info = {
    group_id = 133313494
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 494001, gadget_id = 70290003, pos = { x = -207.813, y = 83.035, z = 5301.737 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 494002, gadget_id = 70540004, pos = { x = -207.726, y = 83.138, z = 5301.708 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3003, area_id = 32 },
	{ config_id = 494003, gadget_id = 70540004, pos = { x = -207.91, y = 83.138, z = 5301.767 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3003, area_id = 32 },
	{ config_id = 494004, gadget_id = 70290003, pos = { x = -274.276, y = 119.136, z = 5400.905 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 494005, gadget_id = 70540004, pos = { x = -274.276, y = 119.239, z = 5400.814 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3003, area_id = 32 },
	{ config_id = 494006, gadget_id = 70540004, pos = { x = -274.276, y = 119.239, z = 5401.006 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3003, area_id = 32 },
	{ config_id = 494007, gadget_id = 70330450, pos = { x = -202.864, y = 88.051, z = 5416.741 }, rot = { x = 348.39, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 494008, gadget_id = 70330449, pos = { x = -202.864, y = 88.051, z = 5416.741 }, rot = { x = 348.391, y = 0.000, z = 0.000 }, level = 32, point_type = 3012, area_id = 32 },
	{ config_id = 494009, gadget_id = 70330450, pos = { x = -186.389, y = 72.418, z = 5362.403 }, rot = { x = 341.24, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 494010, gadget_id = 70330449, pos = { x = -186.389, y = 72.418, z = 5362.403 }, rot = { x = 341.241, y = 0.000, z = 0.000 }, level = 32, point_type = 3012, area_id = 32 },
	{ config_id = 494011, gadget_id = 70330450, pos = { x = -193.209, y = 67.06, z = 5324.608 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 494012, gadget_id = 70330449, pos = { x = -193.209, y = 67.06, z = 5324.608 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, point_type = 3012, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 494003, 494002, 494001, 494012, 494011, 494010, 494009, 494004, 494005, 494006, 494008, 494007 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
