-- 基础信息
local base_info = {
    group_id = 133313351
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 351001, monster_id = 25310301, pos = { x = -823.54, y = 112.241, z = 5599.193 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", disableWander = true, area_id = 32 },
	{ config_id = 351005, monster_id = 28060901, pos = { x = -836.979, y = 101.541, z = 5587.866 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "驮兽镀金旅团", disableWander = true, pose_id = 1, area_id = 32 },
	{ config_id = 351005, monster_id = 28060901, pos = { x = -836.979, y = 101.54072, z = 5587.866 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "驮兽镀金旅团", disableWander = true, pose_id = 1, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 351002, gadget_id = 70220048, pos = { x = -817.773, y = 113.656, z = 5599.187 }, rot = { x = 347.764, y = 353.608, z = 27.861 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 351003, gadget_id = 70220048, pos = { x = -814.732, y = 115.016, z = 5598.534 }, rot = { x = 327.099, y = 11.09, z = 23.32 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 351004, gadget_id = 70220052, pos = { x = -825.729, y = 112.314, z = 5595.085 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 351001, 351005, 351005 },
	gadgets = { 351004, 351003, 351002 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
