-- 基础信息
local base_info = {
    group_id = 133313501
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 501002, monster_id = 24010301, pos = { x = -165.71, y = 42.56, z = 5228.16 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "遗迹重机", pose_id = 101, area_id = 32 },
	{ config_id = 501003, monster_id = 28020108, pos = { x = -201.944, y = 85.243, z = 5301.365 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "走兽", area_id = 32 },
	{ config_id = 501007, monster_id = 21010201, pos = { x = -172.906, y = 100.054, z = 5440.914 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "丘丘人", pose_id = 9010, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 501001, gadget_id = 70310007, pos = { x = -197.252, y = 67.976, z = 5317.823 }, rot = { x = 15.656, y = 111.065, z = 4.9 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 501004, gadget_id = 70220103, pos = { x = -176.081, y = 104.735, z = 5442.699 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 501005, gadget_id = 70220103, pos = { x = -154.656, y = 78.787, z = 5362.088 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 501006, gadget_id = 70310007, pos = { x = -214.044, y = 78.064, z = 5363.288 }, rot = { x = 4.051, y = 53.099, z = 346.985 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 501002, 501003, 501007 },
	gadgets = { 501001, 501006, 501005, 501004 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
