-- 基础信息
local base_info = {
    group_id = 133314498
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    { config_id = 498001, monster_id = 25310101, pos = { x = -702.276, y = 54.966, z = 4447.021 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "中级镀金旅团", disableWander = true, area_id = 32 },
	{ config_id = 498002, monster_id = 25210201, pos = { x = -700.617, y = 55.088, z = 4445.391 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "镀金旅团", pose_id = 9512, area_id = 32 },
	{ config_id = 498005, monster_id = 28010404, pos = { x = -704.848, y = 55.464, z = 4446.681 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "采集动物", pose_id = 1, area_id = 32 },
	{ config_id = 498006, monster_id = 28010404, pos = { x = -704.505, y = 55.488, z = 4445.411 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "采集动物", pose_id = 1, area_id = 32 },
	{ config_id = 498007, monster_id = 28010404, pos = { x = -701.755, y = 55.896, z = 4443.415 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "采集动物", pose_id = 1, area_id = 32 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 498003, gadget_id = 70330428, pos = { x = -704.834, y = 54.777, z = 4446.689 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 498004, gadget_id = 70330428, pos = { x = -704.504, y = 54.802, z = 4445.396 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 498008, gadget_id = 70330428, pos = { x = -701.759, y = 55.209, z = 4443.398 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = { 498002, 498001, 498007, 498005, 498006 },
	gadgets = { 498004, 498003, 498008 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
