-- 基础信息
local base_info = {
    group_id = 133313489
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 489001, gadget_id = 70310007, pos = { x = -179.749, y = 63.494, z = 5137.76 }, rot = { x = 19.17, y = 128.173, z = 14.475 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 489002, gadget_id = 70310007, pos = { x = -188.268, y = 70.096, z = 5181.244 }, rot = { x = 332.083, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 489003, gadget_id = 70210101, pos = { x = -179.399, y = 65.111, z = 5137.826 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 489004, gadget_id = 70210101, pos = { x = -187.92, y = 71.36, z = 5180.259 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 489001, 489003, 489004, 489002 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
