-- 基础信息
local base_info = {
    group_id = 133313371
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 371001, gadget_id = 70710548, pos = { x = -659.694, y = 112.392, z = 5651.203 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 371002, gadget_id = 70210101, pos = { x = -659.334, y = 112.715, z = 5651.596 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 371007, gadget_id = 70310006, pos = { x = -663.719, y = 100.295, z = 5671.199 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 371008, gadget_id = 70300094, pos = { x = -644.567, y = 116.736, z = 5650.179 }, rot = { x = 359.791, y = 8.779, z = 1.356 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 371009, gadget_id = 70210101, pos = { x = -644.293, y = 116.901, z = 5650.773 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 26, drop_tag = "搜刮点解谜人文须弥", persistent = true, area_id = 32 },
	{ config_id = 371010, gadget_id = 70220103, pos = { x = -646.26, y = 119.179, z = 5662.594 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 371011, gadget_id = 71700105, pos = { x = -641.634, y = 116.961, z = 5650.701 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, persistent = true, area_id = 32 },
	{ config_id = 371012, gadget_id = 71700105, pos = { x = -658.07, y = 101.759, z = 5678.206 }, rot = { x = 2.951, y = 0.438, z = 8.439 }, level = 32, persistent = true, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 371002, 371001, 371011, 371010, 371009, 371008, 371012, 371007 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
