-- 基础信息
local base_info = {
    group_id = 133307449
}

--================================================================
-- 
-- 配置
-- 
--================================================================

-- 怪物
monsters = {
    
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
    { config_id = 449001, gadget_id = 70210101, pos = { x = -1491.846, y = 26.643, z = 5626.473 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "搜刮点解谜通用须弥", persistent = true, area_id = 32 },
	{ config_id = 449002, gadget_id = 70210101, pos = { x = -1493.441, y = 26.817, z = 5637.685 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "搜刮点解谜通用须弥", persistent = true, area_id = 32 },
	{ config_id = 449003, gadget_id = 70210101, pos = { x = -1503.536, y = 28.524, z = 5678.78 }, rot = { x = 0.000, y = 0.000, z = 0.000 }, level = 32, drop_tag = "搜刮点解谜通用须弥", persistent = true, area_id = 32 },
	{ config_id = 449004, gadget_id = 70330342, pos = { x = -1488.805, y = 56.730, z = 5215.496 }, rot = { x = 9.398, y = 10.254, z = 338.469 }, level = 26, drop_tag = "摩拉石箱须弥", isOneoff = true, persistent = true, explore = { name = "chest", exp = 4 }, area_id = 32 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
-- 
-- 初始化配置
-- 
--================================================================

-- 初始化时创建
init_config = {
    suite = 1,
    end_suite = 0,
    rand_suite = false
}

--================================================================
-- 
-- 小组配置
-- 
--================================================================

suites = {
	-- suite_id = 1,
	-- description = ,
	monsters = {  },
	gadgets = { 449001, 449002, 449003, 449004 },
	regions = { },
	triggers = { },
	rand_weight = 100
}

--================================================================
-- 
-- 触发器
-- 
--================================================================
